In [1]:
import my_utils as mu
import pandas as pd
import json
import requests
import time
from tqdm import tqdm

In [3]:
mu.reloadPlayRecord('치닭파', '문정환1', 60)

'치닭파': 전적 갱신 중: 100%|██████████| 60/60 [01:03<00:00,  1.06s/it]

입력된 게임 수: 40

### 19 게임 INSERT 기준 속도 비교

##### insertDataFrameIntoTable() 사용 시 약 36초 (1.72s/it)

##### oracle_totalExecute() 사용 시 약 48초 (2.4s/it)

##### oracle_execute() 사용 시 약 31초 (1.49s/it)

### 좌우로 공백문자가 들어가는 기현상

In [69]:
mu.oracle_totalExecute(f"SELECT GAME_ID FROM RAWDATA WHERE PARTICIPANT_NAME = '사슴구름'")

oracle open!
oracle close!

Empty DataFrame
Columns: [GAME_ID]
Index: []

In [74]:
whatis = mu.oracle_totalExecute(f"SELECT PARTICIPANT_NAME FROM RAWDATA WHERE GAME_ID = 'KR_6483755095'")
whatis

oracle open!
oracle close!

  PARTICIPANT_NAME
0             Kail
1            전판 조이
2              Dex
3           Felsen
4             거인용병
5        괜찮은 척 웃을게
6         사슴구름
7       IE BOLTANG
8             초l동희
9             공사럭스

In [75]:
whatis['PARTICIPANT_NAME']

0            Kail
1           전판 조이
2             Dex
3          Felsen
4            거인용병
5       괜찮은 척 웃을게
6        사슴구름
7      IE BOLTANG
8            초l동희
9            공사럭스
Name: PARTICIPANT_NAME, dtype: object

In [76]:
mu.oracle_totalExecute(f"SELECT GAME_ID FROM RAWDATA WHERE PARTICIPANT_NAME = '    사슴구름    '")

oracle open!
oracle close!

          GAME_ID
0   KR_6377463110
1   KR_6490738056
2   KR_6477426972
3   KR_6452279412
4   KR_6452362405
5   KR_6483885684
6   KR_6483755095
7   KR_6484021038
8   KR_6452516372
9   KR_6452439208
10  KR_6452617436
11  KR_6498687917

### UPDATE 문으로 TRIM() 적용 후

In [3]:
mu.oracle_totalExecute(f"SELECT GAME_ID FROM RAWDATA WHERE PARTICIPANT_NAME = '사슴구름'")

oracle open!
oracle close!

          GAME_ID
0   KR_6377463110
1   KR_6490738056
2   KR_6477426972
3   KR_6452279412
4   KR_6452362405
5   KR_6483885684
6   KR_6483755095
7   KR_6484021038
8   KR_6452516372
9   KR_6452439208
10  KR_6452617436
11  KR_6498687917